{
    "pageTitle": "Portfolio - isaquesv",
    
    "themeDropdownOption1": "Light theme",
    "themeDropdownOption2": "Dark theme",
    
    "nav2Link1": "About me",
    "nav2Link2": "Skills",
    "nav2Link3": "Projects",
    "nav2Link4": "Certifications",
    
    "aboutMeTitle": "Backend Developer",
    "aboutMeText": "Student of <a href='https://fatecpg.cps.sp.gov.br/analise-e-desenvolvimento-de-sistemas/'>Systems Analysis and Development</a> at <a href='https://fatecpg.cps.sp.gov.br/'>FATEC Praia Grande</a>, graduate in <a href='https://etecitanhaem.cps.sp.gov.br/category/informatica-para-internet/'>Internet Informatics</a> from <a href='https://etecitanhaem.cps.sp.gov.br/'>ETEC Itanhaém</a>, and passionate about programming, with hands-on experience in web development using HTML, CSS, JavaScript, Bootstrap, Java, API integrations, Artificial Intelligence applications, data handling with SQL, and version control with Git/GitHub.",
    "viewResumeButton": "View resume",
    
    "skillsTitle": "Skills",

    "projectsTitle": "My projects",
    "searchPlaceholder": "Search...",
    "errorMessage": "No project was found for",
    "projectTag1": "APIs",
    "projectTag2": "Websites",
    "projectTag3": "Studies",
    "projectButton1": "Access repository",
    "projectButton2": "Access project",
    "projectButton3": "Access API",
    "projectAuthor1": "Developed by <a href='https://github.com/isaquesv'>isaquesv</a>.",
    "projectAuthor2": "Developed by <a href='https://github.com/isaquesv'>isaquesv</a>, <a href='https://github.com/luiza-carla'>luiza-carla</a>, <a href='https://github.com/ruann-fernandess'>ruann-fernandess</a>.",
    "project1Title": "Who Is That Champion?",
    "project1Text1": "An interactive web-based game where players must guess the mysterious League of Legends champion by analyzing traits revealed progressively each round.",
    "project1Text2": "Built with Java (Maven), HTML, CSS, Bootstrap, JavaScript, and SQLite, integrated with external APIs to retrieve champion data.",
    "project2Title": "Who Is That Champion Data API",
    "project2Text1": "A robust REST API developed with Node.js and hosted on Vercel, designed to provide structured and accurate data about League of Legends champions.",
    "project2Text2": "Created to integrate with the game Who Is That Champion, it offers performance-optimized information to ensure fast responses and a smooth experience for both users and developers.",
    "project3Title": "Calculator",
    "project3Text1": "Interactive web calculator developed using HTML, CSS, Bootstrap, and JavaScript.",
    "project3Text2": "Features three distinct visual themes and full support for decimal operations, including addition, subtraction, multiplication, division, percentages, and factorial calculations. Designed to be responsive, accessible, and practical for daily use.",
    "project4Title": "Radar Praia Grande",
    "project4Text1": "Radar Praia Grande is a collaborative platform that allows citizens to report news, events, and local issues, giving visibility to topics often overlooked by traditional media.",
    "project4Text2": "Using HTML, CSS, JavaScript, Node.js, and SQLite, the system includes an AI that automatically analyzes submitted texts and images, performing an initial screening to increase the reliability of publications.",
    "project5Title": "Portfolio",
    "project5Text1": "My personal responsive portfolio, organized into sections such as About Me, Skills, Projects, Certificates, Resume, and Social Media. It features both light and dark themes, and supports Portuguese (Brazil) and English (US) languages.",
    "project5Text2": "Developed with HTML, CSS, JavaScript, and Bootstrap, the project offers smooth navigation, a modern look, and compatibility with various devices.",
    "project6Title": "EduSIGA (2024)",
    "project6Text1": "An intelligent system that extracts academic data from SIGA (2024) via student login and integrates this information with Gemini AI. Based on the data, the EduSIGA virtual assistant provides personalized support and contextualized answers. The user retains full control over privacy, with the ability to delete conversations and account at any time.",
    "project6Text2": "Created with HTML5, CSS3, JavaScript, Java (Maven), SQL, SQLite, API, AI.",
    "project7Title": "Hora de Codar Java – Course",
    "project7Text1": "Personal repository dedicated to tracking and documenting my progress in the course 'Java from Beginner to Advanced,' taught by Matheus Battisti on the Hora de Codar platform.",
    "project7Text2": "Here I record exercises, projects, and notes covering fundamentals to advanced topics in Java, reinforcing my knowledge and improving my skills in object-oriented programming and other essential language concepts.",
    "project8Title": "Database Lab – Assignments",
    "project8Text1": "Personal repository intended to document and record content and assignments developed for the Database Lab course, taught by Professor Simone Romano during the 5th cycle (1st bimester of 2025) in the Systems Analysis and Development program at FATEC Praia Grande.",
    "project8Text2": "Here I organize exercises, practices, and learnings to consolidate knowledge in modeling, SQL queries, database administration, and other key areas.",
    "project9Title": "Mobile Device Programming – Assignments",
    "project9Text1": "Personal repository for documenting assignments developed in the Mobile Device Programming (MDP) course, taught by Professor Joseffe Oliveira during the 5th cycle (1st bimester of 2025) in the Systems Analysis and Development program at FATEC Praia Grande.",
    "project9Text2": "This space organizes exercises, projects, and studies focused on mobile app development, reinforcing knowledge of platforms and technologies specific to mobile devices.",
    "project10Title": "Object-Oriented Programming – Assignments",
    "project10Text1": "Personal repository for documenting assignments developed in the Object-Oriented Programming (OOP) course, taught by Professor Ricardo Pupo Larguesa during the 4th cycle (2nd bimester of 2024) in the Systems Analysis and Development program at FATEC Praia Grande.",
    "project10Text2": "This space is used to organize exercises, projects, and studies focused on OOP principles and practices, consolidating foundational knowledge for software development.",

    "certificationTitle": "Certifications",
    "certification1Date": "Issued in July 2025",
    "certification1Text": "Certification granted for completing the course \"Java do básico ao avançado – com exercícios e projetos\", taught by Matheus Battisti on the Hora de Codar platform. The course was completed independently on July 14, 2025, with a workload corresponding to the full duration of the available video content at the time.",
    "certification2Date": "Issued in June 2025",
    "certification2Text": "Certification granted for completing the course \"Introdução à IoT e à Transformação Digital\", taken as part of the Computer Networks course during the first semester of 2025, in the Systems Analysis and Development (ADS) program at Fatec Praia Grande.",
    "certification3Date": "Issued in June 2025",
    "certification3Text": "Certification granted for completing the course \"Microsoft Power BI Para Business Intelligence e Data Science\", taken as part of the Database Laboratory course during the first semester of 2025, in the Systems Analysis and Development (ADS) program at Fatec Praia Grande.",
    "certification4Date": "Issued in November 2024",
    "certification4Text": "Certification granted upon successful completion of the final exam for the course \"Database Foundations\", taken during the Database course in the second semester of 2024, as part of the Systems Analysis and Development (ADS) program at Fatec Praia Grande.",
    "certification5Date": "Issued in November 2024",
    "certification5Text": "Certification granted for completing the course \"Database Foundations\", offered as part of the Database course during the second semester of 2024, in the Systems Analysis and Development (ADS) program at Fatec Praia Grande.",
    "certification6Date": "Issued in September 2024",
    "certification6Text": "Certification granted for completing the course \"Fundamentos de Engenharia de Dados\", offered as part of the Database course during the second semester of 2024, in the Systems Analysis and Development (ADS) program at Fatec Praia Grande.",
    "certification7Date": "Issued in March 2023",
    "certification7Text": "Certification of completion for the technical high school course \"Técnico em Informática para Internet\", integrated with high school education and offered by ETEC de Itanhaém.",
    "certification8Date": "Issued in March 2023",
    "certification8Text": "Certification granted for completing the English course \"Immediate Conversation\" at Wizard Itanhaém, with a total workload of 140 hours."
}