{
    "pageTitle": "Portfólio - isaquesv",

    "themeDropdownOption1": "Tema claro",
    "themeDropdownOption2": "Tema escuro",

    "nav2Link1": "Sobre mim",
    "nav2Link2": "Competências",
    "nav2Link3": "Projetos",
    "nav2Link4": "Certificados",

    "aboutMeTitle": "Desenvolvedor Backend",
    "aboutMeText": "Estudante de <a href='https://fatecpg.cps.sp.gov.br/analise-e-desenvolvimento-de-sistemas/'>Análise e Desenvolvimento de Sistemas</a> pela <a href='https://fatecpg.cps.sp.gov.br/'>FATEC de Praia Grande</a>, formado em <a href='https://etecitanhaem.cps.sp.gov.br/category/informatica-para-internet/'>Informática para Internet</a> pela <a href='https://etecitanhaem.cps.sp.gov.br/'>ETEC de Itanhaém</a> e apaixonado por programação, com experiência prática em desenvolvimento web utilizando HTML, CSS, JavaScript, Bootstrap, Java, integrações com APIs, aplicações de Inteligência Artificial, manipulação de dados com SQL e versionamento com Git/GitHub.",
    "viewResumeButton": "Visualizar currículo",

    "skillsTitle": "Competências",

    "projectsTitle": "Meus projetos",
    "searchPlaceholder": "Pesquise...",
    "errorMessage": "Nenhum projeto foi encontrado para",
    "projectTag1": "APIs",
    "projectTag2": "Sites",
    "projectTag3": "Estudos",
    "projectButton1": "Acessar repositório",
    "projectButton2": "Acessar projeto",
    "projectButton3": "Acessar API",
    "projectAuthor1": "Desenvolvido por <a href='https://github.comeuisaquevenancio'>isaquesv</a>.",
    "projectAuthor2": "Desenvolvido por <a href='https://github.comeuisaquevenancio'>isaquesv</a>, <a href='https://github.com/luiza-carla'>luiza-carla</a>, <a href='https://github.com/ruann-fernandess'>ruann-fernandess</a>.",
    "project1Title": "Who Is That Champion?",
    "project1Text1": "Um jogo interativo baseado na web em que os jogadores devem adivinhar o campeão misterioso do League of Legends, analisando características reveladas progressivamente a cada rodada.",
    "project1Text2": "Criado com Java (Maven), HTML, CSS, Bootstrap, JavaScript, SQLite e integrado a APIs externas para obter os dados dos campeões.",
    "project2Title": "Who Is That Champion Data API",
    "project2Text1": "Uma API REST robusta, desenvolvida com Node.js e hospedada na Vercel, criada para fornecer dados estruturados e precisos sobre campeões de League of Legends.",
    "project2Text2": "Pensada para integrar o jogo Who Is That Champion, ela oferece informações otimizadas para desempenho, garantindo respostas rápidas e uma experiência fluida tanto para usuários quanto para desenvolvedores.",
    "project3Title": "Calculadora",
    "project3Text1": "Calculadora web interativa, desenvolvida com HTML, CSS, Bootstrap e JavaScript.",
    "project3Text2": "Conta com três temas visuais distintos e suporte completo a operações decimais, incluindo adição, subtração, multiplicação, divisão, porcentagens e cálculo de fatoriais. Projetada para ser responsiva, acessível e prática no uso diário.",
    "project4Title": "Radar Praia Grande",
    "project4Text1": "Radar Praia Grande é uma plataforma colaborativa que permite aos cidadãos reportar notícias, eventos e problemas locais, dando visibilidade a temas frequentemente ignorados pela mídia tradicional.",
    "project4Text2": "Utilizando HTML, CSS, JavaScript, Node.js e SQLite, o sistema conta com uma IA que analisa automaticamente textos e imagens enviados, realizando uma triagem inicial para aumentar a confiabilidade das publicações.",
    "project5Title": "Portfólio",
    "project5Text1": "Meu portfólio pessoal responsivo, organizado em seções como Sobre Mim, Competências, Projetos, Certificados, Currículo e redes sociais. Possui temas claro e escuro, além de suporte aos idiomas Português (Brasil) e Inglês (EUA).",
    "project5Text2": "Desenvolvido com HTML, CSS, JavaScript e Bootstrap, o projeto oferece uma navegação fluida, visual moderno e compatibilidade com diferentes dispositivos.",
    "project6Title": "EduSIGA (2024)",
    "project6Text1": "Sistema inteligente que extrai dados acadêmicos do SIGA (2024) via login do aluno e integra essas informações à IA do Gemini. Com base nos dados, a assistente virtual EduSIGA oferece suporte personalizado e respostas contextualizadas. O usuário mantém total controle sobre sua privacidade, podendo excluir conversas e apagar a conta a qualquer momento.",
    "project6Text2": "Criado com HTML5, CSS3, JavaScript, Java (Maven), SQL, SQLite, API, IA.",
    "project7Title": "Hora de Codar Java - Curso",
    "project7Text1": "Repositório pessoal dedicado ao acompanhamento e documentação do meu aprendizado no curso 'Java do Básico ao Avançado', ministrado por Matheus Battisti na plataforma Hora de Codar.",
    "project7Text2": "Aqui registro exercícios, projetos e anotações que abrangem desde os fundamentos até tópicos avançados da linguagem Java, consolidando meus conhecimentos e aprimorando minhas habilidades em programação orientada a objetos e demais conceitos essenciais da linguagem.",
    "project8Title": "Laboratório de Banco de Dados - Tarefas",
    "project8Text1": "Repositório pessoal destinado ao registro e documentação dos conteúdos e tarefas desenvolvidos na disciplina de Laboratório de Banco de Dados (LdBD), ministrada pela professora Simone Romano no 5º ciclo (1º bimestre de 2025) do curso de Análise e Desenvolvimento de Sistemas da FATEC de Praia Grande.",
    "project8Text2": "Aqui organizo meus exercícios, práticas e aprendizados para consolidar o conhecimento em modelagem, consultas SQL, administração e outras áreas fundamentais de banco de dados.",
    "project9Title": "Programação para Dispositivos Mobile - Tarefas",
    "project9Text1": "Repositório pessoal destinado ao registro e documentação das tarefas desenvolvidas na disciplina de Programação para Dispositivos Mobile (PpDM), ministrada pelo professor Joseffe Oliveira no 5º ciclo (1º bimestre de 2025) do curso de Análise e Desenvolvimento de Sistemas da FATEC de Praia Grande.",
    "project9Text2": "Neste espaço organizo exercícios, projetos e estudos focados no desenvolvimento de aplicações móveis, consolidando conhecimentos em plataformas e tecnologias específicas para dispositivos mobile.",
    "project10Title": "Programação Orientada a Objetos - Tarefas",
    "project10Text1": "Repositório pessoal destinado ao registro e documentação das tarefas desenvolvidas na disciplina de Programação Orientada a Objetos (POO), ministrada pelo professor Ricardo Pupo Larguesa no 4º ciclo (2º bimestre de 2024) do curso de Análise e Desenvolvimento de Sistemas da FATEC de Praia Grande.",
    "project10Text2": "Neste espaço organizo exercícios, projetos e estudos focados nos princípios e práticas da programação orientada a objetos, consolidando fundamentos essenciais para o desenvolvimento de software.",
    
    "certificationTitle": "Certificados",
    "certification1Date": "Verificação emitida em julho de 2025",
    "certification1Text": "Certificação concedida pela conclusão do curso \"Java do básico ao avançado – com exercícios e projetos\", ministrado por Matheus Battisti na plataforma Hora de Codar, concluído em 14 de julho de 2025. O curso foi realizado de forma autônoma, com carga horária correspondente à duração total dos vídeos disponíveis no momento da conclusão.",
    "certification2Date": "Verificação emitida em junho de 2025",
    "certification2Text": "Certificação concedida pela conclusão do curso \"Introdução à IoT e à Transformação Digital\", oferecido na disciplina de Redes de Computadores durante o 1º semestre de 2025, no curso de Análise e Desenvolvimento de Sistemas (ADS) da Fatec Praia Grande.",
    "certification3Date": "Verificação emitida em junho de 2025",
    "certification3Text": "Certificação concedida pela conclusão do curso \"Microsoft Power BI Para Business Intelligence e Data Science\", oferecido na disciplina de Laboratório de Banco de Dados durante o 1º semestre de 2025, no curso de Análise e Desenvolvimento de Sistemas (ADS) da Fatec Praia Grande.",
    "certification4Date": "Verificação emitida em novembro de 2024",
    "certification4Text": "Certificação concedida pela conclusão do exame final do curso \"Database Foundations\", realizado durante a disciplina de Banco de Dados no 2º semestre de 2024, no curso de Análise e Desenvolvimento de Sistemas (ADS) da Fatec Praia Grande.",
    "certification5Date": "Verificação emitida em novembro de 2024",
    "certification5Text": "Certificação concedida pela conclusão do curso \"Database Foundations\", oferecido na disciplina de Banco de Dados durante o 2º semestre de 2024, no curso de Análise e Desenvolvimento de Sistemas (ADS) da Fatec Praia Grande.",
    "certification6Date": "Verificação emitida em setembro de 2024",
    "certification6Text": "Certificação concedida pela conclusão do curso \"Fundamentos de Engenharia de Dados\", oferecido na disciplina de Banco de Dados durante o 2º semestre de 2024, no curso de Análise e Desenvolvimento de Sistemas (ADS) da Fatec Praia Grande.",
    "certification7Date": "Verificação emitida em março de 2023",
    "certification7Text": "Certificado concedido pela conclusão do curso técnico em Informática para Internet, integrado ao Ensino Médio, oferecido pela ETEC de Itanhaém.",
    "certification8Date": "Verificação emitida em março de 2023",
    "certification8Text": "Certificado concedido pela conclusão do curso de inglês \"Immediate Conversation\" na Wizard Itanhaém, com carga horária total de 140 horas."
}